Revit 2026 API

# ElementIsValidType(ElementId) Method

---

Checks if given type is valid for this element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidType(
	ElementId typeId
)
```
```vb
Public Function IsValidType (
	typeId As ElementId
) As Boolean
```
```cpp
public:
bool IsValidType(
	ElementId^ typeId
)
```
```fsharp
member IsValidType :
        typeId : ElementId -> bool
```

#### Parameters

typeId ElementId
     ElementId of the type to check.

#### Return Value

Boolean True if element can have a type assigned and this type is valid for this element, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A type is valid for an element if it can be assigned to the element.

#### Reference

Element Class

IsValidType Overload

Autodesk.Revit.DB Namespace